{"class_name": "Model", "config": {"name": "gusDMF_G159-175_CondVae_withperturb", "layers": [{"name": "x_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8100], "dtype": "float32", "sparse": false, "name": "x_input"}, "inbound_nodes": []}, {"name": "label_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_input"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "x_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8100], "dtype": "float32", "sparse": false, "name": "x_input"}, "inbound_nodes": []}, {"name": "label_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_input"}, "inbound_nodes": []}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": 1}, "inbound_nodes": [[["x_input", 0, 0, {}], ["label_input", 0, 0, {}]]]}, {"name": "dense_10", "class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "z_mean", "class_name": "Dense", "config": {"name": "z_mean", "trainable": true, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"name": "z_log_var", "class_name": "Dense", "config": {"name": "z_log_var", "trainable": true, "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"name": "z", "class_name": "Lambda", "config": {"name": "z", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAUAAABDAAAAc0oAAAB8AFwCfQF9AnQAoAF8AaEBZAEZAH0DdACgAnwBoQFk\nAhkAfQR0AGoDfAN8BGYCZAONAX0FfAF0AKAEZAR8AhQAoQF8BRQAFwBTACkF+sxSZXBhcmFtZXRl\ncml6YXRpb24gdHJpY2sgYnkgc2FtcGxpbmcgZnJvbSBhbiBpc290cm9waWMgdW5pdCBHYXVzc2lh\nbi4KICAgICMgQXJndW1lbnRzCiAgICAgICAgYXJncyAodGVuc29yKTogbWVhbiBhbmQgbG9nIG9m\nIHZhcmlhbmNlIG9mIFEoenxYKQogICAgIyBSZXR1cm5zCiAgICAgICAgeiAodGVuc29yKTogc2Ft\ncGxlZCBsYXRlbnQgdmVjdG9yCiAgICDpAAAAAOkBAAAAKQHaBXNoYXBlZwAAAAAAAOA/KQXaAUty\nBAAAANoJaW50X3NoYXBl2g1yYW5kb21fbm9ybWFs2gNleHApBtoEYXJnc9oGel9tZWFu2gl6X2xv\nZ192YXLaBWJhdGNo2gNkaW3aB2Vwc2lsb26pAHIPAAAA+iIvdG1wL2lweWtlcm5lbF8xNTQ1OTAv\nMjg2MTEyODAwLnB52ghzYW1wbGluZwEAAABzCgAAAAAHCAEOAQ4CEAE=\n", null, null], "function_type": "lambda", "output_shape": [3], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["z_mean", 0, 0, {}], ["z_log_var", 0, 0, {}]]]}], "input_layers": [["x_input", 0, 0], ["label_input", 0, 0]], "output_layers": [["z_mean", 0, 0], ["z_log_var", 0, 0], ["z", 0, 0]]}, "inbound_nodes": [[["x_input", 0, 0, {}], ["label_input", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "z_sampling", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "z_sampling"}, "inbound_nodes": []}, {"name": "label_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "label_input"}, "inbound_nodes": []}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": -1}, "inbound_nodes": [[["z_sampling", 0, 0, {}], ["label_input", 0, 0, {}]]]}, {"name": "dense_11", "class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"name": "dense_12", "class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "units": 8101, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "input_layers": [["z_sampling", 0, 0], ["label_input", 0, 0]], "output_layers": [["dense_12", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}], ["label_input", 0, 0, {}]]]}], "input_layers": [["x_input", 0, 0], ["label_input", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}